20230711192749-bubble_sort.org
:PROPERTIES:
:ID:       550e0301-0b4d-4a19-915d-2dd5d0cea67b
:END:
#+title: Bubble Sort
#+filetags: :Algorithms:
#+property: header-args :tangle code/algorithms/bubbleSort.js

* Bubble Sort

Largest item *"bubbles up"* to correct position

*Time complexity*: ~O(n^2)~

Each *outer* *loop* shrinks the unsorted window from the right.

** JavaScript

#+BEGIN_SRC js
const bubbleSort = (array) => {
  const arr = array.slice() // Create shallow copy of array to avoid mutation (Pure Function)
  for (let i = 0; i < arr.length - 1; i++) {
    for (let j = 0; j < arr.length - 1 - i; j++) {
      if (arr[j] > arr[j + 1]) {
        const temp =  arr[j]
        arr[j] =  arr[j + 1]
        arr[j + 1] = temp
      }
    }
  }
  return arr
}

const array = [2, 19, 4, 25, 6, 520]
console.log(bubbleSort(array))
#+END_SRC

** Java
- ~j end~ = ~numbers.length - i - 1~
- ~j max index~ is the last j where ~j + 1~ is still valid
- *Sorted* *at* *end* shows which elements are already guaranteed correct
  
#+BEGIN_SRC java
public static void sort(double num1, double num2, double num3, double num4) {
    double[] numbers = {num1, num2, num3, num4};

    for (int i = 0; i < numbers.length - 1; i++) {
        for (int j = 0; j < numbers.length - i - 1; j++) {
            if (numbers[j] > numbers[j + 1]) {
                int temp = (int) numbers[j];
                numbers[j] = numbers[j + 1];
                numbers[j+1] = temp;
            }
        }
    }
    System.out.println(Arrays.toString(numbers));
}

public static void main(String[] args) {
    sort(23.0, 69.0, 11, 2);
}
// [11.0, 23.0, 69.0, 2.0]
#+END_SRC

| i | j | j < length - i - 1 | Compared indexes | Values compared | Swap? | Array after step        |
|---+---+--------------------+------------------+-----------------+-------+-------------------------|
| 0 | 0 | 0 < 3 (true)       | 0 ↔ 1            | 23.0 ↔ 69.0     | No    | [23.0, 69.0, 11.0, 2.0] |
| 0 | 1 | 1 < 3 (true)       | 1 ↔ 2            | 69.0 ↔ 11.0     | Yes   | [23.0, 11.0, 69.0, 2.0] |
| 0 | 2 | 2 < 3 (true)       | 2 ↔ 3            | 69.0 ↔ 2.0      | Yes   | [23.0, 11.0, 2.0, 69.0] |
|---+---+--------------------+------------------+-----------------+-------+-------------------------|
| 1 | 0 | 0 < 2 (true)       | 0 ↔ 1            | 23.0 ↔ 11.0     | Yes   | [11.0, 23.0, 2.0, 69.0] |
| 1 | 1 | 1 < 2 (true)       | 1 ↔ 2            | 23.0 ↔ 2.0      | Yes   | [11.0, 2.0, 23.0, 69.0] |
|---+---+--------------------+------------------+-----------------+-------+-------------------------|
| 2 | 0 | 0 < 1 (true)       | 0 ↔ 1            | 11.0 ↔ 2.0      | Yes   | [2.0, 11.0, 23.0, 69.0] |
