20230711192749-bubble_sort.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bubble Sort</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bubble Sort</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0984b21">1. Bubble Sort</a>
<ul>
<li><a href="#orge46af9d">1.1. JavaScript</a></li>
<li><a href="#org4d89ede">1.2. Java</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0984b21" class="outline-2">
<h2 id="org0984b21"><span class="section-number-2">1.</span> Bubble Sort</h2>
<div class="outline-text-2" id="text-1">
<p>
Largest item <b>"bubbles up"</b> to correct position
</p>

<p>
<b>Time complexity</b>: <code>O(n^2)</code>
</p>

<p>
Each <b>outer</b> <b>loop</b> shrinks the unsorted window from the right.
</p>
</div>

<div id="outline-container-orge46af9d" class="outline-3">
<h3 id="orge46af9d"><span class="section-number-3">1.1.</span> JavaScript</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">const</span> <span class="org-variable-name">bubbleSort</span> = (array) =&gt; {
  <span class="org-keyword">const</span> <span class="org-variable-name">arr</span> = array.slice() <span class="org-comment-delimiter">// </span><span class="org-comment">Create shallow copy of array to avoid mutation (Pure Function)
</span>  <span class="org-keyword">for</span> (<span class="org-keyword">let</span> <span class="org-variable-name">i</span> = 0; i &lt; arr.length - 1; i++) {
    <span class="org-keyword">for</span> (<span class="org-keyword">let</span> <span class="org-variable-name">j</span> = 0; j &lt; arr.length - 1 - i; j++) {
      <span class="org-keyword">if</span> (arr[j] &gt; arr[j + 1]) {
        <span class="org-keyword">const</span> <span class="org-variable-name">temp</span> =  arr[j]
        arr[j] =  arr[j + 1]
        arr[j + 1] = temp
      }
    }
  }
  <span class="org-keyword">return</span> arr
}

<span class="org-keyword">const</span> <span class="org-variable-name">array</span> = [2, 19, 4, 25, 6, 520]
console.log(bubbleSort(array))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d89ede" class="outline-3">
<h3 id="org4d89ede"><span class="section-number-3">1.2.</span> Java</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><code>j end</code> = <code>numbers.length - i - 1</code></li>
<li><code>j max index</code> is the last j where <code>j + 1</code> is still valid</li>
<li><b>Sorted</b> <b>at</b> <b>end</b> shows which elements are already guaranteed correct</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">sort</span>(<span class="org-type">double</span> <span class="org-variable-name">num1</span>, <span class="org-type">double</span> <span class="org-variable-name">num2</span>, <span class="org-type">double</span> <span class="org-variable-name">num3</span>, <span class="org-type">double</span> <span class="org-variable-name">num4</span>) {
    <span class="org-type">double</span>[] <span class="org-variable-name">numbers</span> = {num1, num2, num3, num4};

    <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; numbers.<span class="org-type">length</span> - 1; i++) {
        <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">j</span> = 0; j &lt; numbers.<span class="org-type">length</span> - i - 1; j++) {
            <span class="org-keyword">if</span> (numbers[j] &gt; numbers[j + 1]) {
                <span class="org-type">int</span> <span class="org-variable-name">temp</span> = (<span class="org-type">int</span>) numbers[j];
                numbers[j] = numbers[j + 1];
                numbers[j+1] = temp;
            }
        }
    }
    System.out.println(Arrays.toString(numbers));
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    sort(23.0, 69.0, 11, 2);
}
<span class="org-comment-delimiter">// </span><span class="org-comment">[11.0, 23.0, 69.0, 2.0]</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">i</th>
<th scope="col" class="org-right">j</th>
<th scope="col" class="org-left">j &lt; length - i - 1</th>
<th scope="col" class="org-left">Compared indexes</th>
<th scope="col" class="org-left">Values compared</th>
<th scope="col" class="org-left">Swap?</th>
<th scope="col" class="org-left">Array after step</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">0 &lt; 3 (true)</td>
<td class="org-left">0 ↔ 1</td>
<td class="org-left">23.0 ↔ 69.0</td>
<td class="org-left">No</td>
<td class="org-left">[23.0, 69.0, 11.0, 2.0]</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-left">1 &lt; 3 (true)</td>
<td class="org-left">1 ↔ 2</td>
<td class="org-left">69.0 ↔ 11.0</td>
<td class="org-left">Yes</td>
<td class="org-left">[23.0, 11.0, 69.0, 2.0]</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-left">2 &lt; 3 (true)</td>
<td class="org-left">2 ↔ 3</td>
<td class="org-left">69.0 ↔ 2.0</td>
<td class="org-left">Yes</td>
<td class="org-left">[23.0, 11.0, 2.0, 69.0]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">0 &lt; 2 (true)</td>
<td class="org-left">0 ↔ 1</td>
<td class="org-left">23.0 ↔ 11.0</td>
<td class="org-left">Yes</td>
<td class="org-left">[11.0, 23.0, 2.0, 69.0]</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">1 &lt; 2 (true)</td>
<td class="org-left">1 ↔ 2</td>
<td class="org-left">23.0 ↔ 2.0</td>
<td class="org-left">Yes</td>
<td class="org-left">[11.0, 2.0, 23.0, 69.0]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">0</td>
<td class="org-left">0 &lt; 1 (true)</td>
<td class="org-left">0 ↔ 1</td>
<td class="org-left">11.0 ↔ 2.0</td>
<td class="org-left">Yes</td>
<td class="org-left">[2.0, 11.0, 23.0, 69.0]</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
